# Pandas

by Hanzholah Shobri, 23 April 2022

This is a personal notebook I use to learn Pandas as one of the Scientific Computing libraries. See more at [this repository](https://github.com/hanzholahs/AI-Engineering-Bootcamp).

To help me learn, I use these sites as my reference: [Pandas Documentation](https://pandas.pydata.org/docs/); [Article by Reka Horvath](https://realpython.com/pandas-python-explore-dataset/); and [Article by Mirko Stojiljković](https://realpython.com/pandas-dataframe/). Here, I also take some notes by copying texts from the website with and without summarising/paraphrasing.

In [2]:
import numpy as np
import pandas as pd

## Pandas Overview

`pandas` provides fast, flexible, and expressive data structures designed to work with “relational” or “labeled” data.

The two primary data structures of pandas, Series (1-dimensional) and DataFrame (2-dimensional), handle the vast majority of typical use cases in finance, statistics, social science, and many areas of engineering. 

Here are just a few of the things that pandas does well:

* handling of missing data (represented as NaN)
* size mutability (insertion and deletion of data from DataFrame and higher dimensional objects)
* automatic and explicit data alignment
* `group by` functionality to perform split-apply-combine operations on data sets
* easy conversion in other Python and NumPy data structures
* intellegent label-based slicing, indexing, and subsetting
* reshaping, pivoting, merging and joining data
* hierarchhical labeling of axes (possible to have multiple labels per tick)
* I/O tools
* time series-specific functionality

## Data Structure

There are two data structures in Pandas:

* **Series**: 1D labeled homogeneously-typed array
* **DataFrame**: General 2D labeled, size-mutable tabular structure with potentially heterogeneously-typed column

`pandas` data structures is flexible containers for lower dimensional data. For example, DataFrame is a container for Series, and Series is a container for scalars.

All `pandas` data structures are value-mutable (the values they contain can be altered) but not always size-mutable.

### Series - Creating a Series

`Series` is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index.

In [34]:
# Create series from a list
salary = pd.Series([23500, 42400, 84100, 43200, 92800, 12500], 
                   index = ['Jo', 'Ma', 'Bi', 'Ke', 'La', 'Po'])
salary

Jo    23500
Ma    42400
Bi    84100
Ke    43200
La    92800
Po    12500
dtype: int64

In [12]:
# Create series from ndarray
pd.Series(np.random.randint(1, 10, 5))

0    4
1    1
2    8
3    2
4    6
dtype: int32

In [15]:
# Create series from ndarray with index
pd.Series(np.random.randint(1, 10, 5), index = ['a', 'b', 'c', 'd', 'e'])

a    8
b    3
c    5
d    1
e    3
dtype: int32

In [17]:
# Create series from dictionary
d = {'A': 5, 'B':7, 'C':3}
pd.Series(d)

A    5
B    7
C    3
dtype: int64

In [19]:
# Create series from a scalar value
pd.Series(5.25, index = ['s', 't', 'u', 'v'])

s    5.25
t    5.25
u    5.25
v    5.25
dtype: float64

### Series - Comparing with `ndarray` and `dict`
`Series` acts very similarly to a `ndarray`, and is a valid argument to most NumPy functions.

A `series` can be indexed with it labels like a dictionary.

In [24]:
# Slice the first element
salary[0]

23500

In [25]:
# Slice the last two elements
salary[-2:]

4    92800
5    12500
dtype: int64

In [26]:
# Calculate median
salary.median()

42800.0

In [28]:
# find low salary
salary[salary < 25000]

0    23500
5    12500
dtype: int64

In [36]:
# mathematical function on a series
np.exp(pd.Series([1,2,3,4,5]))

0      2.718282
1      7.389056
2     20.085537
3     54.598150
4    148.413159
dtype: float64

In [37]:
# vector operation on a series
salary * 12 - 25000

Jo     257000
Ma     483800
Bi     984200
Ke     493400
La    1088600
Po     125000
dtype: int64

In [32]:
# data type of a series
salary.dtype

dtype('int64')

In [35]:
# Select data by index
salary["Po"]

12500

### DataFrame - Creating DataFrames

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. To create a DataFrame, it accepts many different kinds of input:

* Dict of 1D ndarrays, lists, dicts, or Series
* 2-D `numpy.ndarray`
* Structured or record ndarray
* A `Series`
* Another `DataFrame`

In [45]:
# Create a dataframe from a dictionary of series
d = {
    "A": pd.Series([1,6,3,4,6], index = ['a', 'b', 'c', 'f', 'g']),
    "B": pd.Series([4.6, 2.3, 3.4, 5.6, 3.8, 3.7], index = ['a', 'b', 'c', 'd', 'g', 'h'])
}
pd.DataFrame(d)

     A    B
a  1.0  4.6
b  6.0  2.3
c  3.0  3.4
d  NaN  5.6
f  4.0  NaN
g  6.0  3.8
h  NaN  3.7

In [57]:
# Create a dataframe from a dictionary of ndarrays / lists
d = {"A": np.random.randint(1, 100, 5), 
     "B": [2.23, 4.56, 5.73, 5.32, 5.47],
     "C": [2, 5, 6, 3, 5]}
pd.DataFrame(d, index = range(1, 6))

    A     B  C
1  98  2.23  2
2  81  4.56  5
3  67  5.73  6
4  22  5.32  3
5  99  5.47  5

In [62]:
# Create a dataframe from a list of dictionary
l = [{"a": 1, "b": 2}, 
     {"b": 3, "c": 24},
     {"a": 5, "b": 10, "c": 20}, 
     {"a": 13, "c": 2}]
pd.DataFrame(l)

      a     b     c
0   1.0   2.0   NaN
1   NaN   3.0  24.0
2   5.0  10.0  20.0
3  13.0   NaN   2.0

### DataFrame - Adding and Deleting Columns

In [86]:
# Add a new column to an existing dataframe
df = pd.DataFrame(l)

df["d"] = "Sample A"
df["e"] = ["1", "1", "2", "2"]
df["f"] = ["4", "5", "4", "5"]
df.insert(3, "..new..", df["b"])

df

      a     b     c  ..new..         d  e  f
0   1.0   2.0   NaN      2.0  Sample A  1  4
1   NaN   3.0  24.0      3.0  Sample A  1  5
2   5.0  10.0  20.0     10.0  Sample A  2  4
3  13.0   NaN   2.0      NaN  Sample A  2  5

In [87]:
# delete a column
del df["f"]
df

      a     b     c  ..new..         d  e
0   1.0   2.0   NaN      2.0  Sample A  1
1   NaN   3.0  24.0      3.0  Sample A  1
2   5.0  10.0  20.0     10.0  Sample A  2
3  13.0   NaN   2.0      NaN  Sample A  2

### DataFrame - Accessing Elements

In [76]:
# Select column "a" in df
df["a"]

0     1.0
1     NaN
2     5.0
3    13.0
Name: a, dtype: float64

In [83]:
# Select column "b" in df
df.b

0     2.0
1     3.0
2    10.0
3     NaN
Name: b, dtype: float64

In [84]:
# Access elements in df
df["b"][1], df["d"][3], df["e"][2]

(3.0, 'Sample A', '2')

In [125]:
# Filter specified rows
df[df.b >= 3]

       a     b     c  ..new..         d  e
Kai  NaN   3.0  24.0      3.0  Sample A  1
Loe  5.0  10.0  20.0     10.0  Sample A  2

### Pandas Accessors

There are four Pandas accessors:
* `df.loc[]`: label index to access rows or columns, including their parts (it returns a Series or DataFrame).
* `df.iloc[]`: positional index to access rows and columns, including their parts (it returns a Series or DataFrame).
* `df.at[]`: label index to access a single data value.
* `df.iat[]`: positional index to access a single data value.

`df` refers to a dataframe object.

In [97]:
df.index = ["Joa", "Kai", "Loe", "Nui"]

In [100]:
df.loc[["Joa", "Kai"], :]

       a    b     c  ..new..         d  e
Joa  1.0  2.0   NaN      2.0  Sample A  1
Kai  NaN  3.0  24.0      3.0  Sample A  1

In [102]:
df.loc[["Joa", "Kai"], "e"]

Joa    1
Kai    1
Name: e, dtype: object

In [105]:
df.iloc[:, 1:3]

        b     c
Joa   2.0   NaN
Kai   3.0  24.0
Loe  10.0  20.0
Nui   NaN   2.0

In [107]:
df.iloc[:, [1,4,5]]

        b         d  e
Joa   2.0  Sample A  1
Kai   3.0  Sample A  1
Loe  10.0  Sample A  2
Nui   NaN  Sample A  2

In [120]:
df.iat[2, 1]

10.0

In [121]:
df.iloc[2, 1]

10.0

In [118]:
df.at["Joa", "a"]

1.0

In [122]:
df.loc["Joa", "a"]

1.0

## Manipulating Data

### Concatenating DataFrames

In [243]:
df1 = pd.DataFrame(
    {"T": ["A1", "A2", "A3"],
     "A": np.random.randint(1, 100, 3),
     "B": np.random.rand(3),
     "C": np.random.randn(3) * 5
    },
    index = range(3)
)

df2 = pd.DataFrame(
    {"T": ["B1", "B2", "B3"],
     "A": np.random.randint(1, 100, 3),
     "B": np.random.rand(3) * 2,
     "C": np.random.randn(3) * 15
    },
    index = range(3, 6)
)

df3 = pd.DataFrame(
    {"T": ["C1", "C2", "C3"],
     "A": np.random.randint(1, 100, 3),
     "B": np.random.rand(3) * 3,
     "C": np.random.randn(3) * 25
    },
    index = range(6, 9)
)

df4 = pd.DataFrame(
    {"D": np.random.randint(-20, 50, 4),
     "E": np.random.rand(4) * 30,
     "F": np.random.randn(4) * 250
    },
    index=[1, 2, 3, 5],
)

frames = [df1, df2, df3]

In [193]:
# Concatenate the three tables along axis 0 (row)
pd.concat(frames)

    T   A         B          C
0  A1  54  0.334162  -3.005192
1  A2  20  0.880275   2.522345
2  A2  67  0.359222  -0.022543
3  B1   3  1.964834  17.495099
4  B2  69  1.934187  -2.275329
5  B3  67  1.784727  36.293834
6  C1  67  2.147670  -1.019577
7  C2  19  0.149071 -40.394522
8  C3  21  0.905333  23.355614

In [188]:
# Concatenate the three tables with hierarchical index
pd.concat(frames, keys = ["A", "B", "C"])

      T   A         B          C
A 0  A1  54  0.334162  -3.005192
  1  A2  20  0.880275   2.522345
  2  A2  67  0.359222  -0.022543
B 3  B1   3  1.964834  17.495099
  4  B2  69  1.934187  -2.275329
  5  B3  67  1.784727  36.293834
C 6  C1  67  2.147670  -1.019577
  7  C2  19  0.149071 -40.394522
  8  C3  21  0.905333  23.355614

In [192]:
# Concatenate dataframes along axis 1 (column)
pd.concat([df1, df2, df4], axis = 1, join = "outer") # join="outer" is the default

,T,A,B,C,T,A,B,C,D,E,F
0,A1,54.0,0.334162,-3.005192,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,A2,20.0,0.880275,2.522345,NaN,NaN,NaN,NaN,-15.0,0.321643,130.521988
2,A2,67.0,0.359222,-0.022543,NaN,NaN,NaN,NaN,0.0,10.022872,-81.503211
3,NaN,NaN,NaN,NaN,B1,3.0,1.964834,17.495099,7.0,2.786687,248.809833
4,NaN,NaN,NaN,NaN,B2,69.0,1.934187,-2.275329,NaN,NaN,NaN
5,NaN,NaN,NaN,NaN,B3,67.0,1.784727,36.293834,20.0,29.467086,-30.203732

In [196]:
# Concatenate the intersection of df1 and df4 along axis 2
pd.concat([df1, df4], axis = 1, join = "inner")

    T   A         B         C   D          E           F
1  A2  20  0.880275  2.522345 -15   0.321643  130.521988
2  A2  67  0.359222 -0.022543   0  10.022872  -81.503211

In [195]:
# Concatenate the intersection of df2 and df4 along axis 2
pd.concat([df2, df4], axis = 1, join = "inner")

    T   A         B          C   D          E           F
3  B1   3  1.964834  17.495099   7   2.786687  248.809833
5  B3  67  1.784727  36.293834  20  29.467086  -30.203732

In [215]:
# Append a new column into a dataframe with a series
s = pd.Series(np.exp([1, 3, 5]), name = "Exp", index = df2.index)
pd.concat([df2, s], axis = 1)

    T   A         B          C         Exp
3  B1   3  1.964834  17.495099    2.718282
4  B2  69  1.934187  -2.275329   20.085537
5  B3  67  1.784727  36.293834  148.413159

In [224]:
# Append a new row into a dataframe with a series
s = pd.Series(["C4", 34, np.random.rand(), np.random.rand()],
             index = ["T", "A", "B", "C"])
pd.concat([df2, s.to_frame().T], ignore_index = True)

    T   A        B         C
0  B1   3  1.96483   17.4951
1  B2  69  1.93419  -2.27533
2  B3  67  1.78473   36.2938
3  C4  34   0.3308  0.732924

### Joining/Merging Dataframe

In [236]:
df5 = pd.DataFrame(
    {"T": ["A1", "A3", "B2", "B3"],
     "D": np.random.randint(-20, 50, 4),
     "E": np.random.rand(4) * 30,
     "F": np.random.randn(4) * 250
    },
    index=[1, 2, 3, 5],
)

In [246]:
# Merge df1 and df5 on T
pd.merge(df1, df5, on = "T")

    T   A         B         C   D          E           F
0  A1  23  0.115986  1.144414  27   7.302773  104.277344
1  A3  58  0.374324  7.336329  10  11.498996  108.005265

In [248]:
# Merge df2 and df5 on T using right join
pd.merge(df2, df5, on = "T", how = "right")

    T     A         B          C   D          E           F
0  B2  57.0  0.905129 -11.545584  11  16.080034  243.709216
1  B3  17.0  1.527667  -1.520329   7  26.549970 -270.425708
2  A1   NaN       NaN        NaN  27   7.302773  104.277344
3  A3   NaN       NaN        NaN  10  11.498996  108.005265

In [250]:
# Merge df2 and df5 on T using outer join
pd.merge(df2, df5, on = "T", how = "outer")

    T     A         B          C     D          E           F
0  B1  47.0  0.821472   6.717648   NaN        NaN         NaN
1  B2  57.0  0.905129 -11.545584  11.0  16.080034  243.709216
2  B3  17.0  1.527667  -1.520329   7.0  26.549970 -270.425708
3  A1   NaN       NaN        NaN  27.0   7.302773  104.277344
4  A3   NaN       NaN        NaN  10.0  11.498996  108.005265

In [251]:
# Merge df2 and df5 on T using inner join
pd.merge(df2, df5, on = "T", how = "inner")

    T   A         B          C   D          E           F
0  B2  57  0.905129 -11.545584  11  16.080034  243.709216
1  B3  17  1.527667  -1.520329   7  26.549970 -270.425708

### Group by - Split, Apply, Combine

"Group by" refers to a process involving one or more of the following steps:
* **Splitting** the data into groups based on some criteria.
* **Applying** a function to each group independently.
  * Aggregating to compute summary statistics for each group
  * Transforming group-specific values
  * Filtering according to a group-wise logical evaluation
* **Combining** the results into a data structure.

In [372]:
# Prepare dataset to work with
df = pd.DataFrame(
    [("bird", "Falconiformes", 389.0),
     ("bird", "Psittaciformes", 24.0),
     ("mammal", "Carnivora", 80.2),
     ("mammal", "Primates", np.nan),
     ("mammal", "Carnivora", 58),
    ],
    index=["falcon", "parrot", "lion", "monkey", "leopard"],
    columns=("class", "order", "max_speed"),
)
df

d = {
    "Date": pd.date_range("10/1/1999", periods=1000),
    "A": np.repeat(["DKJ1", "AWA2"], 500),
    "B": np.repeat(["A", "B", "C", "D"], 250),
    "CA": np.random.normal(75, 15, 1000),
    "SB": np.random.randint(250, 500, 1000)
}

df = pd.DataFrame(d)
df

          Date     A  B         CA   SB
0   1999-10-01  DKJ1  A  58.763960  280
1   1999-10-02  DKJ1  A  97.153670  374
2   1999-10-03  DKJ1  A  67.529809  268
3   1999-10-04  DKJ1  A  74.519511  428
4   1999-10-05  DKJ1  A  71.252170  385
..         ...   ... ..        ...  ...
995 2002-06-22  AWA2  D  68.297654  431
996 2002-06-23  AWA2  D  76.755207  416
997 2002-06-24  AWA2  D  76.430772  273
998 2002-06-25  AWA2  D  56.944889  356
999 2002-06-26  AWA2  D  69.531703  434

[1000 rows x 5 columns]

In [374]:
df.groupby("A"), df.groupby("B"), df.groupby("Date")

(<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021BA325E048>,
 <pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021BA2FE9F08>,
 <pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000021BA2FE9EC8>)

In [375]:
# Find slowest speed for each class
df.groupby("B").min()

        Date     A         CA   SB
B
A 1999-10-01  DKJ1  33.560788  250
B 2000-06-07  DKJ1  31.976572  250
C 2001-02-12  AWA2  37.823696  251
D 2001-10-20  AWA2  35.132579  252

In [378]:
# Filter for bird
df.groupby("A").get_group("AWA2")

          Date     A  B         CA   SB
500 2001-02-12  AWA2  C  71.238408  432
501 2001-02-13  AWA2  C  72.348390  361
502 2001-02-14  AWA2  C  65.447803  308
503 2001-02-15  AWA2  C  68.410352  251
504 2001-02-16  AWA2  C  62.633915  399
..         ...   ... ..        ...  ...
995 2002-06-22  AWA2  D  68.297654  431
996 2002-06-23  AWA2  D  76.755207  416
997 2002-06-24  AWA2  D  76.430772  273
998 2002-06-25  AWA2  D  56.944889  356
999 2002-06-26  AWA2  D  69.531703  434

[500 rows x 5 columns]

In [379]:
# Perform aggregation (compute a summary statistic)
df.groupby("A").aggregate([np.sum, np.mean, np.std])

               CA                            SB
              sum       mean        std     sum     mean        std
A
AWA2  37838.35707  75.676714  15.837969  184567  369.134  71.348843
DKJ1  36920.70733  73.841415  14.800840  187018  374.036  70.284668

In [380]:
# Perform transofrmation
df.groupby("B").transform(lambda x: (x - x.mean()) / x.std())

           CA        SB
0   -1.022963 -1.266659
1    1.542507  0.057709
2   -0.437167 -1.435727
3    0.029933  0.818515
4   -0.188413  0.212688
..        ...       ...
995 -0.496024  0.822318
996  0.023956  0.620888
997  0.004010 -1.299412
998 -1.194005 -0.184832
999 -0.420153  0.862604

[1000 rows x 2 columns]

In [387]:
# Perform filtration
df.groupby("B").filter(lambda x: x["SB"].sum() > 92500)

          Date     A  B         CA   SB
250 2000-06-07  DKJ1  B  41.738105  350
251 2000-06-08  DKJ1  B  84.155505  297
252 2000-06-09  DKJ1  B  93.018432  256
253 2000-06-10  DKJ1  B  81.734554  322
254 2000-06-11  DKJ1  B  79.616030  278
..         ...   ... ..        ...  ...
495 2001-02-07  DKJ1  B  71.101740  351
496 2001-02-08  DKJ1  B  31.976572  281
497 2001-02-09  DKJ1  B  54.270213  369
498 2001-02-10  DKJ1  B  64.943841  262
499 2001-02-11  DKJ1  B  77.618444  446

[250 rows x 5 columns]

In [388]:
# Use apply for more flexible operations
df.dropna().groupby("A").apply(lambda x: x.min())

           Date     A  B         CA   SB
A
AWA2 2001-02-12  AWA2  C  35.132579  251
DKJ1 1999-10-01  DKJ1  A  31.976572  250